HCHCHC99/WS_L/ws_L_v.inmop_curloop/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/template/source/main.c

  #include "main.h"
  #include "Hardware.h"
  #include "rtt_log.h"
  #include "timer6_timebase.h"
  #include "TickTimer.h"
  #include "App_Motor_Project.h"
  #include "App_Comm.h"
  #include "App_FaultHandler.h"
  #include "rtt_manager.h"
  #include "hc32_ll_utility.h"
  #include "tmr4_pwm.h"
#include "dev_comm_runner.h"
#include "Bemf.h"
#include "I.h"
#include "motor_config.h"
#include "cur_loop.h"
#include "foc.h"
#include "encoder.h"
#include "Usart3_Vofa.h"
#include "Usart3_Vofa_Runner.h"
#include "test_Vofa.h"
#include "../Utils/dev_pid.h"

/* Official Vofa handle (for Vofa_JustFloat / Vofa_Printf etc.) */
Vofa_HandleTypedef vofa1;

/* Hall sensor raw pins (from hall_sensor_3ch.c ISR, updated in real-time) */
extern volatile uint8_t g_scope_ha;   /* Hall U, bit2 */
extern volatile uint8_t g_scope_hb;   /* Hall V, bit1 */
extern volatile uint8_t g_scope_hc;   /* Hall W, bit0 */
extern volatile uint8_t g_scope_step; /* Current commutation step (0-5) */

/*=============================================================================
 * Keil Watch ��改变�??? (调试接口)
 *=============================================================================*/
volatile int   comm_mode        = 0;     /* 0=Stop 1=OpenFW 2=OpenRV 3=ClosedFW 4=ClosedRV 5=Calibrate 6=CalibCW 7=CalibCCW 8=PID_CW 9=PID_CCW 10=CurLoopFW 11=CascadeFW 21=FocOpenLoop 22=FocCurrentLoop 23=FocAlign */
volatile float g_comm_duty_pct  = 80.0f; /* Duty cycle 2%~98% */

/* PID speed control �??? Keil Watch variables */
volatile float g_target_rpm       = 3000.0f;

/* PID config �??? all fields volatile, Keil Watch can modify at runtime */
pid_config_t g_pid_cfg = {
    .enabled      = true,
    .p_valid      = true,
    .i_valid      = true,
    .d_valid      = false,
    .kp           = 0.02f,
    .ki           = 0.005f,
    .kd           = 0.0f,
    .output_min   = 2.0f,
    .output_max   = 98.0f,
    .integral_max = 50.0f,
    .update_ms    = 50,
};

/* �??? PWM 全局变量 (dev_motor 模块引用, 不可删除) */
pwm_t g_motor_pwm_ch1;
pwm_t g_motor_pwm_ch2;
pwm_t g_motor_pwm_ch3;
pwm_t g_motor_pwm_ch4;

/*=============================================================================
 * Hall 映射�??? (16�??? × 8�???)
 *   0~5: 同� (霍尔+1=磁场CW)
 *   6~11: 偏移 (霍尔+1=磁场CCW)
 *   12: 实测校准 CW
 *   13: CCW (磁场CCW超前)
 *   14: 强拖正转 [sector+90°]
 *   15: 强拖反转 [sector-90°]
 *=============================================================================*/
int main(void)
{
    /* ---- �件初始�??? ---- */
    Hardware_Init();
	MAIN_D("111111");

#if 0  /* RS485 Modbus disabled, PB12/PB13 now used for USART3 */
    /* ---- 通信�??? (RS485 + Modbus RTU) ---- */
    static const App_Comm_Config_t comm_cfg = {
        .phy.baudrate     = 9600,
        .phy.dir_polarity = 0,
        .hal.rx_buf_size  = 500,
        .hal.tx_buf_size  = 500,
        .hal.rx_frame_queue_depth = 10,
        .hal.tx_queue_depth       = 10,
        .hal.frame_timeout_ms     = 0,
        .proto.node_id            = 1,
        .proto.enable_write_multi = true,
    };
    App_Comm_Init(&comm_cfg);
#endif  /* RS485 Modbus disabled */
    /* ---- USART3 + VOFA+ 初始�?? ---- */
    /* VOFA+ 全�?: 921600 baud, ~5760 frame/s max */
    {
        Usart3_HW_Config_t cfg = USART3_HW_CONFIG_DEFAULT;
        cfg.baudrate = 921600;
        Usart3_Vofa_Init(&cfg);
    }
    Usart3_Vofa_Runner_Init();
    Vofa_Init(&vofa1, VOFA_MODE_SKIP);

#if VOFA_TEST_ENABLE
    TestVofa_Init();
#endif

    tickTimer_DelayMs(5);

    /* ---- 换相控制器初始化 ---- */
    static const comm_runner_config_t runner_cfg = {
        .pwm_freq_hz       = MOTOR_PWM_FREQ_HZ,

        /* Hall 传感器配�???: 3�???, PA10=U, PA9=V, PA8=W, 3对极 */
#if MOTOR_HALL_ENABLE
        .hall_cfg = {
            .port      = {GPIO_PORT_A, GPIO_PORT_A, GPIO_PORT_A},
            .pin       = {GPIO_PIN_10, GPIO_PIN_09, GPIO_PIN_08},
            .eirq_ch   = {EXTINT_CH10, EXTINT_CH09, EXTINT_CH08},
            .irqn      = {INT010_IRQn, INT009_IRQn, INT008_IRQn},
            .irq_src   = {INT_SRC_PORT_EIRQ10, INT_SRC_PORT_EIRQ9, INT_SRC_PORT_EIRQ8},
            .irq_priority = DDL_IRQ_PRIO_02,
            .pole_pairs   = 3,
            /* 默��场对齐�???: step0�???0x01, 磁场正向 */
            .hall_to_step = {0xFF,1,3,2,5,0,4,0xFF},
            /* on_step/on_fault �??? CommRunner 内部覆写 */
            .on_step      = NULL,
            .on_fault     = NULL,
            .align_step        = 0,
            .align_duty_pct    = 80.0f,
            .align_duration_ms = 500,
            .stall_timeout_ms  = 500,
        },
#endif /* MOTOR_HALL_ENABLE */

        /* ��恒� (mode 1/2): 667 RPM 定� 3s 斜坡 */
        .ol_const_start_us  = 5000,
        .ol_const_target_us = 5000,
        .ol_const_ramp_ms   = 3000,

        /* 飞启�� (mode 3/4): 167�???1111 RPM, 2s 斜坡 */
        .ol_fly_start_us    = 20000,
        .ol_fly_target_us   = 3000,
        .ol_fly_ramp_ms     = 2000,

        .default_duty_pct   = 80.0f,
        .on_init_done       = NULL,
        .pid_cfg           = &g_pid_cfg,
    };
    CommRunner_Init(&runner_cfg);

    /* ---- BEMF 初始�?? (PWM 已启�??, TMR4_3 正在运行) ---- */
    Bemf_Init();

    /* ---- 电流采样初始�? (ADC1_SEQ_B, PWM peak 触发, 频率�? MOTOR_PWM_FREQ_HZ) ---- */
    I_Init();

    /* ---- 电流零偏校准 (阻塞500ms, 电机必须静止) ---- */
    I_Calibrate();

    /* ---- 电流环初始化 (挂到 ADC1 EOCB ISR, 频率�? MOTOR_PWM_FREQ_HZ) ---- */
    CurLoop_Init();

#if MOTOR_FOC_ENABLE
    /* ---- FOC 初始�? (注册第二�? ISR 回调�?, 不启动输�?; 模式 21 启动) ---- */
    Foc_Init();
#endif

    /* ---- ABZ encoder (TIMERA_1 quadrature + Z index) ---- */
    Encoder_Init();

    EventBus_Enable();

    /* ---- 电流 VOFA+ 全速发�?? (DMA 背压, ~2.9kHz max @921600, 16ch) ---- */

    /* ---- 主循�?? ---- */
    static int   s_prev_mode     = -1;
    static float s_prev_duty     = 80.0f;
    static int   s_foc_fault_printed = 0;
    static uint8_t  s_if_burst_armed = 0u;
    static uint32_t s_if_burst_cnt   = 0u;
    static uint32_t s_if_burst_last  = 0u;

    while (1) {
//         App_Comm_Poll();

        /* Keil Watch �??? CommRunner (调试�???/Modbus 下发的模式切�???) */
        if (comm_mode != s_prev_mode) {
            int s_prev_mode_before = s_prev_mode;
            s_prev_mode = comm_mode;
#if MOTOR_FOC_ENABLE
            if ((comm_mode == 21) || (comm_mode == 22) || (comm_mode == 23)) {
                /* FOC mode: keep runner s_mode in sync (Update is no-op),
                 * then start FOC complementary PWM (21=open-loop,
                 * 22=current-loop I-F start, 23=standstill align). */
                CommRunner_SetMode((comm_runner_mode_t)comm_mode);
                if (comm_mode == 22) {
                    Foc_StartCurrentLoop();
                } else if (comm_mode == 23) {
                    Foc_StartAlign();
                } else {
                    Foc_StartOpenLoop();
                }
            } else {
                /* Leaving FOC mode 21/22/23: stop FOC PWM, restart the shared
                 * TMR4 counter (Foc_Stop stops it) for six-step modes. */
                if ((s_prev_mode_before == 21) || (s_prev_mode_before == 22) ||
                    (s_prev_mode_before == 23)) {
                    Foc_Stop();
                    TMR4_PWM_StartOutput();
                }
                CommRunner_SetMode((comm_runner_mode_t)comm_mode);
            }
#else
            CommRunner_SetMode((comm_runner_mode_t)comm_mode);
#endif
        }
        if (g_comm_duty_pct != s_prev_duty) {
            s_prev_duty = g_comm_duty_pct;
            CommRunner_SetDuty(g_comm_duty_pct);
        }

        /* 驱动换相状��??? */
        CommRunner_Update();

        /* ABZ encoder: position + speed */
        Encoder_Update();

        /* g_bemf_wave_data �?? Bemf_DataCallback() �?? DMA BTC ISR 中自动更�??
         * (根据 g_scope_step 选择浮空�??, 计算 floating_raw - neutral_raw) */

        /* CommRunner �??? Keil Watch (堵转等内部触发的 STOP 同�回�) */
        {
            int actual = (int)CommRunner_GetMode();
            if (actual != comm_mode) {
                comm_mode   = actual;
                s_prev_mode = actual;
            }
        }

#if MOTOR_FOC_ENABLE
        /* FOC over-current fault: print once per event (integer only) */
        if (g_foc_fault != 0u) {
            if (!s_foc_fault_printed) {
                s_foc_fault_printed = 1;
                MAIN_D("[FOC] FAULT oc=%d stage=%d i=%d mA iu=%d iv=%d iw=%d mA\r\n",
                      (int)g_foc_fault, (int)g_foc_fault_stage, (int)g_foc_fault_i_ma,
                      (int)g_foc_fault_iu_ma, (int)g_foc_fault_iv_ma, (int)g_foc_fault_iw_ma);
            }
        } else {
            s_foc_fault_printed = 0;
        }
#endif
#if MOTOR_FOC_ENABLE
        /* Encoder manual-turn pulse counter (set g_enc_dbg_print=1 in Watch) */
        if (g_enc_dbg_print) {
            static uint32_t s_last_enc = 0u;
            uint32_t now_e = tickTimer_GetCount();
            if ((now_e - s_last_enc) >= 100u) {
                s_last_enc = now_e;
                MAIN_D("[ENC] cnt=%d rev=%u\r\n",
                       (int)g_enc_count, (unsigned)g_enc_rev);
            }
        }

        /* FOC I-F high-rate burst (100ms x 30) right after hold done */
        if (s_if_burst_armed && g_foc_active && (g_foc_mode == FOC_MODE_CURLOOP)) {
            uint32_t now_b = tickTimer_GetCount();
            if ((s_if_burst_last == 0u) || ((now_b - s_if_burst_last) >= 100u)) {
                s_if_burst_last = now_b;
                MAIN_D("[FOC][IFB] t=%u rotor=%d mrad theta=%d mrad diff=%d mrad rel=%d mrad win=[%d,%d] band=%d mrad dir=%d spd=%d iq=%d mA iqref=%d mA iqpi=%d mA id=%d mA vd=%d mV cnt=%d rev=%u sweep=%d cHz vq=%d vlim=%d mV\r\n",
                              (unsigned)(s_if_burst_cnt * 100u),
                              (int)(g_foc_if_rotor_rad * 1000.0f),
                              (int)(g_foc_theta_rad * 1000.0f),
                              (int)(g_foc_if_diff_rad * 1000.0f),
                              (int)(g_foc_if_rel_diff_rad * 1000.0f),
                              (int)(g_foc_if_win_min_rad * 1000.0f),
                              (int)(g_foc_if_win_max_rad * 1000.0f),
                              (int)(g_foc_if_sync_band_rad * 1000.0f),
                              (int)g_enc_dir,
                              (int)g_enc_speed_rpm,
                              (int)g_foc_iq_ma,
                              (int)g_foc_iq_ref_ma,
                              (int)g_foc_iq_pi_ma,
                              (int)g_foc_id_ma,
                              (int)(g_foc_vd * 1000.0f),
                              (int)g_enc_count,
                              (unsigned)g_enc_rev,
                              (int)g_foc_if_sweep_cHz,
                              (int)(g_foc_vq * 1000.0f),
                              (int)(g_foc_vlim_v * 1000.0f));
                if (++s_if_burst_cnt >= 30u) {
                    s_if_burst_armed = 0u;
                }
            }
        }

        /* FOC I-F periodic status (1s) so we can see the diff trend in RTT */
        if (g_foc_active && (g_foc_mode == FOC_MODE_CURLOOP)) {
            static uint32_t s_last_if = 0u;
            uint32_t now_ms = tickTimer_GetCount();
            if ((now_ms - s_last_if) >= 1000u) {
                s_last_if = now_ms;
                MAIN_D("[FOC][IF] freq=%d cHz ph=%d iq=%d mA iqref=%d mA iqpi=%d mA id=%d mA vd=%d mV rotor=%d mrad theta=%d mrad diff=%d mrad lock=%d mrad rel=%d mrad win=[%d,%d] band=%d mrad good=%d dir=%d spd=%d rpm sync=%d sweep=%d cHz vq=%d vlim=%d mV\r\n",
                              (int)(g_foc_if_freq_hz * 100.0f),
                              (int)g_foc_phase,
                              (int)g_foc_iq_ma,
                              (int)g_foc_iq_ref_ma,
                              (int)g_foc_iq_pi_ma,
                              (int)g_foc_id_ma,
                              (int)(g_foc_vd * 1000.0f),
                              (int)(g_foc_if_rotor_rad * 1000.0f),
                              (int)(g_foc_theta_rad * 1000.0f),
                              (int)(g_foc_if_diff_rad * 1000.0f),
                              (int)(g_foc_if_lock_diff_rad * 1000.0f),
                              (int)(g_foc_if_rel_diff_rad * 1000.0f),
                              (int)(g_foc_if_win_min_rad * 1000.0f),
                              (int)(g_foc_if_win_max_rad * 1000.0f),
                              (int)(g_foc_if_sync_band_rad * 1000.0f),
                              (int)g_foc_if_good_cnt,
                              (int)g_enc_dir,
                              (int)g_enc_speed_rpm,
                              (int)g_foc_if_sync,
                              (int)g_foc_if_sweep_cHz,
                              (int)(g_foc_vq * 1000.0f),
                              (int)(g_foc_vlim_v * 1000.0f));
            }
        }

        /* FOC open-loop status (1s): speed sign/value tells the field direction */
        if (g_foc_active && (g_foc_mode == FOC_MODE_OPENLOOP)) {
            static uint32_t s_last_ol = 0u;
            uint32_t now_ol = tickTimer_GetCount();
            if ((now_ol - s_last_ol) >= 1000u) {
                s_last_ol = now_ol;
                MAIN_D("[FOC][OL] spd=%d rpm theta=%d mrad volt=%d mV\r\n",
                       (int)g_enc_speed_rpm,
                       (int)(g_foc_theta_rad * 1000.0f),
                       (int)(g_foc_openloop_volt_v * 1000.0f));
            }
        }

        /* FOC I-F start events - printed here in main loop (never ISR) */
        if (g_foc_if_evt != 0u) {
            uint8_t ievt = g_foc_if_evt;
            g_foc_if_evt = 0u;
            switch (ievt) {
            case 1u:
                MAIN_D("[FOC][IF] hold done -> ramp freq=%d cHz iqref=%d mA\r\n",
                       (int)g_foc_if_evt_v1, (int)g_foc_if_evt_v2);
                s_if_burst_armed = 1u;
                s_if_burst_cnt   = 0u;
                s_if_burst_last  = 0u;
                break;
            case 2u:
                MAIN_D("[FOC][IF] handover ok offset=%d iq=%d mA freq=%d cHz\r\n",
                       (int)g_foc_if_evt_v1, (int)g_foc_if_evt_v2, (int)g_foc_if_evt_v3);
                break;
            case 3u:
                MAIN_D("[FOC][IF] TIMEOUT freq=%d cHz iq=%d mA rotor=%d mrad theta=%d mrad diff=%d mrad lock=%d mrad rel=%d mrad win=[%d,%d] band=%d mrad sweep=%d cHz vq=%d vlim=%d mV\r\n",
                              (int)g_foc_if_evt_v1, (int)g_foc_if_evt_v2,
                              (int)(g_foc_if_rotor_rad * 1000.0f),
                              (int)(g_foc_theta_rad * 1000.0f),
                              (int)(g_foc_if_diff_rad * 1000.0f),
                              (int)(g_foc_if_lock_diff_rad * 1000.0f),
                              (int)(g_foc_if_rel_diff_rad * 1000.0f),
                              (int)(g_foc_if_win_min_rad * 1000.0f),
                              (int)(g_foc_if_win_max_rad * 1000.0f),
                              (int)(g_foc_if_sync_band_rad * 1000.0f),
                              (int)g_foc_if_evt_v4,
                              (int)(g_foc_vq * 1000.0f), (int)(g_foc_vlim_v * 1000.0f));
                break;
            default:
                break;
            }
        }

        /* FOC align calibration events - printed here in main loop (never ISR) */
        if (g_foc_align_evt != 0u) {
            uint8_t evt = g_foc_align_evt;
            g_foc_align_evt = 0u;
            switch (evt) {
            case 1u:
                MAIN_D("[FOC][ALIGN] start volt=%d mV\r\n", (int)g_foc_align_evt_v1);
                break;
            case 2u:
                MAIN_D("[FOC][ALIGN] beta done -> alpha\r\n");
                break;
            case 3u:
                MAIN_D("[FOC][ALIGN] locked offset=%d id=%d iq=%d\r\n",
                       (int)g_foc_align_evt_v1, (int)g_foc_align_evt_v2,
                       (int)g_foc_align_evt_v3);
                break;
            case 4u:
                MAIN_D("[FOC][ALIGN] done offset=%d vd=%d vq=%d mV\r\n",
                       (int)g_foc_align_evt_v1, (int)g_foc_align_evt_v2,
                       (int)g_foc_align_evt_v3);
                break;
            case 5u:
                MAIN_D("[FOC][ALIGN] FAULT code=%d i=%d mA\r\n",
                       (int)g_foc_align_evt_v1, (int)g_foc_align_evt_v2);
                break;
            default:
                break;
            }
        }
#endif

        /* ---- BEMF 数据读取 (�???500ms打印一次观察数�???) ---- */
#ifdef BEMF_PERIODIC_DBG
        {
            static uint32_t s_u32LastBemfPrintMs = 0;
            uint32_t u32Now = tickTimer_GetCount();
            if ((u32Now - s_u32LastBemfPrintMs) >= 500) {
                s_u32LastBemfPrintMs = u32Now;
                if (g_bemf_running) {
                    MAIN_D("BEMF: wave=%d step=%u raw: M=%u U=%u V=%u W=%u cnt=%lu\r\n",
                           g_bemf_wave_data, g_scope_step,
                           g_bemf_m_raw, g_bemf_u_raw, g_bemf_v_raw, g_bemf_w_raw,
                           g_bemf_sample_cnt);
                }
            }
        }
#endif

        /* ---- Target RPM: Keil Watch -> PID ---- */
        {
            static float s_last_target = 0.0f;
            if (g_target_rpm != s_last_target) {
                s_last_target = g_target_rpm;
                CommRunner_SetTargetRPM(g_target_rpm);
            }
        }

        /* ---- VOFA+ USART3: 全速电�?? + 心跳 + RX 日志 ---- */
        if (!Usart3_Vofa_IsTxBusy()) {
            int32_t cur[22];

            /* EMA low-pass filter for BEMF display channels (α=0.05; fc/BTC rate scale with MOTOR_PWM_FREQ_HZ)
             * y[n] = α·x[n] + (1-α)·y[n-1], applied on raw ADC before mV conversion */
            #define BEMF_EMA_ALPHA  0.05f
            static float s_fEmaM = 0.0f, s_fEmaU = 0.0f, s_fEmaV = 0.0f, s_fEmaW = 0.0f;
            static uint8_t s_bEmaInit = 0;
            if (!s_bEmaInit) {
                /* Seed filter states with first sample (no ramp-up) */
                s_fEmaM = (float)g_bemf_m_raw;
                s_fEmaU = (float)g_bemf_u_raw;
                s_fEmaV = (float)g_bemf_v_raw;
                s_fEmaW = (float)g_bemf_w_raw;
                s_bEmaInit = 1;
            } else {
                s_fEmaM = BEMF_EMA_ALPHA * (float)g_bemf_m_raw + (1.0f - BEMF_EMA_ALPHA) * s_fEmaM;
                s_fEmaU = BEMF_EMA_ALPHA * (float)g_bemf_u_raw + (1.0f - BEMF_EMA_ALPHA) * s_fEmaU;
                s_fEmaV = BEMF_EMA_ALPHA * (float)g_bemf_v_raw + (1.0f - BEMF_EMA_ALPHA) * s_fEmaV;
                s_fEmaW = BEMF_EMA_ALPHA * (float)g_bemf_w_raw + (1.0f - BEMF_EMA_ALPHA) * s_fEmaW;
            }

            /* g_i_ix_disp = filt_mA * 10 + 10000, inverse: (disp - 10000) / 10 */
            cur[0] = (int32_t)(g_i_iu_disp - 10000) / 10;   /* IU mA �?? A */
            cur[1] = (int32_t)(g_i_iv_disp - 10000) / 10;   /* IV mA �?? A */
            cur[2] = (int32_t)(g_i_iw_disp - 10000) / 10;   /* IW mA �?? A */
            /* Hall: reconstruct combined from scope bits (g_scope_ha=bit2, hb=bit1, hc=bit0) */
            uint8_t hall = (uint8_t)((g_scope_ha << 2) | (g_scope_hb << 1) | g_scope_hc);
            cur[3] = (int32_t)hall * 1000;                  /* Hall combined ×1000 �?? A */
            cur[4] = (int32_t)g_scope_ha * 1000;            /* HU ×1000 �?? A */
            cur[5] = (int32_t)g_scope_hb * 1000;            /* HV ×1000 �?? A */
            cur[6] = (int32_t)g_scope_hc * 1000;            /* HW ×1000 �?? A */
            /* BEMF voltage (mV = EMA(raw) × 3300 / 4096, ×1000 �?? VOFA+ displays mV) */
            #define RAW_TO_MV(r) ((int32_t)((int32_t)(r) * 3300 / 4096))
            cur[7]  = RAW_TO_MV((int32_t)s_fEmaM) * 1000;   /* M_BEMF (PA0) mV */
            cur[8]  = RAW_TO_MV((int32_t)s_fEmaU) * 1000;   /* U_BEMF (PA1) mV */
            cur[9]  = RAW_TO_MV((int32_t)s_fEmaV) * 1000;   /* V_BEMF (PA2) mV */
            cur[10] = RAW_TO_MV((int32_t)s_fEmaW) * 1000;   /* W_BEMF (PA3) mV */
            /* BEMF diff: phase - neutral (mV, from EMA-filtered values) */
            cur[11] = RAW_TO_MV((int32_t)(s_fEmaU - s_fEmaM)) * 1000;  /* U-M mV */
            cur[12] = RAW_TO_MV((int32_t)(s_fEmaV - s_fEmaM)) * 1000;  /* V-M mV */
            cur[13] = RAW_TO_MV((int32_t)(s_fEmaW - s_fEmaM)) * 1000;  /* W-M mV */
            /* CH14: floating phase BEMF (mV, EMA-filtered, auto-selected by Hall step, ISR-updated) */
            {
                static float s_fEmaWave = 0.0f;
                if (!s_bEmaInit) {
                    s_fEmaWave = (float)g_bemf_wave_data;
                } else {
                    s_fEmaWave = BEMF_EMA_ALPHA * (float)g_bemf_wave_data
                               + (1.0f - BEMF_EMA_ALPHA) * s_fEmaWave;
                }
                cur[14] = (int32_t)(s_fEmaWave * 3300.0f / 4096.0f) * 1000;
            }
            /* CH15: U-V line BEMF (mV, EMA-filtered) */
            cur[15] = RAW_TO_MV((int32_t)(s_fEmaU - s_fEmaV)) * 1000;
            /* Current-loop channels (mA; SCALE_MILLI -> A) */
            cur[16] = (int32_t)g_i_ref_ma;     /* 17th float: final target current (mA) */
            cur[17] = (int32_t)g_scope_i_fb;   /* 18th float: measured current (mA) */
            cur[18] = (int32_t)g_scope_i_ref;  /* 19th float: next-step (ramped) current setpoint (mA) */
            /* Current-loop tuning observables (SCALE_MILLI: mA->A, duty*1000->%) */
            cur[19] = (int32_t)g_scope_i_err;          /* 20th float: current error (mA -> A) */
            cur[20] = (int32_t)(g_scope_i_duty * 1000.0f); /* 21st float: duty (%) */
            cur[21] = (int32_t)g_scope_i_fb_raw;       /* 22nd float: raw windowed fb (mA -> A) */
            #undef RAW_TO_MV
            Usart3_Vofa_SendScaled(cur, 22, USART3_VOFA_SCALE_MILLI);
        }

        Usart3_Vofa_FeedRx(&vofa1);   /* ring_buf -> Vofa FIFO (official API) */
        Usart3_Vofa_Runner_Run();     /* heartbeat + RX MAIN_D logging */

#if VOFA_TEST_ENABLE
        TestVofa_Run();               /* CH1 sawtooth + CH2 counter (disabled) */
#endif
    }
}

